#ifndef TESTER_H
#define TESTER_H
#include "store.h"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
struct Tester
{
    char* getRandomBytes(int length);                                                     // Получение рандомного массива байтов, заданного размера
    unsigned int writeTest(Store* ptrStore, int nWrites, int bitsKey, int bitsValue);     // Тест на скорость записи: хранилище данных, количество записей, размер ключа/значения
    unsigned int readTest(Store* ptrStore, int nReads, int bitsKey);                      // Тест на скорость чтения, параметры те же
    unsigned int overwriteTest(Store* ptrStore, int nWrites, int bitsKey, int bitsValue); // Тест на скорость перезаписи половины данных: хранилище данных, количество записей, размер ключа/значения
};
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#endif // TESTER_H
